----------------------------------------------------------------------
 
Starting the code ( Thu Feb 15 21:37:35 2018 ): Lukkarinen_Case_2_Run_01.py
 
Training dataset.
Found 1237 images belonging to 2 classes.
Validation dataset.
Found 413 images belonging to 2 classes.
Test dataset.
Found 413 images belonging to 2 classes.
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_330 (Conv2D)          (None, 148, 198, 32)      896       
_________________________________________________________________
conv2d_331 (Conv2D)          (None, 146, 196, 32)      9248      
_________________________________________________________________
max_pooling2d_100 (MaxPoolin (None, 72, 97, 32)        0         
_________________________________________________________________
conv2d_332 (Conv2D)          (None, 70, 95, 64)        18496     
_________________________________________________________________
conv2d_333 (Conv2D)          (None, 68, 93, 64)        36928     
_________________________________________________________________
max_pooling2d_101 (MaxPoolin (None, 33, 46, 64)        0         
_________________________________________________________________
conv2d_334 (Conv2D)          (None, 31, 44, 96)        55392     
_________________________________________________________________
conv2d_335 (Conv2D)          (None, 29, 42, 96)        83040     
_________________________________________________________________
max_pooling2d_102 (MaxPoolin (None, 14, 20, 96)        0         
_________________________________________________________________
conv2d_336 (Conv2D)          (None, 12, 18, 128)       110720    
_________________________________________________________________
conv2d_337 (Conv2D)          (None, 10, 16, 128)       147584    
_________________________________________________________________
conv2d_338 (Conv2D)          (None, 8, 14, 160)        184480    
_________________________________________________________________
conv2d_339 (Conv2D)          (None, 6, 12, 160)        230560    
_________________________________________________________________
dropout_52 (Dropout)         (None, 6, 12, 160)        0         
_________________________________________________________________
conv2d_340 (Conv2D)          (None, 4, 10, 192)        276672    
_________________________________________________________________
conv2d_341 (Conv2D)          (None, 2, 8, 192)         331968    
_________________________________________________________________
dropout_53 (Dropout)         (None, 2, 8, 192)         0         
_________________________________________________________________
flatten_22 (Flatten)         (None, 3072)              0         
_________________________________________________________________
dense_33 (Dense)             (None, 256)               786688    
_________________________________________________________________
dropout_54 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_34 (Dense)             (None, 1)                 257       
=================================================================
Total params: 2,272,929
Trainable params: 2,272,929
Non-trainable params: 0
_________________________________________________________________
Epoch 1/10
39/39 [==============================] - 480s - loss: 4.5594 - acc: 0.7102 - val_loss: 4.6442 - val_acc: 0.7119
Epoch 2/10
39/39 [==============================] - 447s - loss: 4.6645 - acc: 0.7106 - val_loss: 4.4881 - val_acc: 0.7215
Epoch 3/10
39/39 [==============================] - 447s - loss: 4.6315 - acc: 0.7127 - val_loss: 4.7223 - val_acc: 0.7070
Epoch 4/10
39/39 [==============================] - 453s - loss: 4.6513 - acc: 0.7114 - val_loss: 4.8393 - val_acc: 0.6998
Epoch 5/10
39/39 [==============================] - 442s - loss: 4.6183 - acc: 0.7135 - val_loss: 4.1368 - val_acc: 0.7433
Epoch 6/10
39/39 [==============================] - 445s - loss: 4.6447 - acc: 0.7118 - val_loss: 4.9174 - val_acc: 0.6949
Epoch 7/10
39/39 [==============================] - 455s - loss: 4.6249 - acc: 0.7131 - val_loss: 4.6052 - val_acc: 0.7143
Epoch 8/10
39/39 [==============================] - 470s - loss: 4.6513 - acc: 0.7114 - val_loss: 4.6052 - val_acc: 0.7143
Epoch 9/10
39/39 [==============================] - 426s - loss: 4.6381 - acc: 0.7122 - val_loss: 4.3710 - val_acc: 0.7288
Epoch 10/10
39/39 [==============================] - 424s - loss: 4.6513 - acc: 0.7114 - val_loss: 5.0735 - val_acc: 0.6852
 
Total elapsed time for training: 74.934 minutes
 
Model is saved to file: Lukkarinen_Case_2_Run_01.h5
History is saved to file: Lukkarinen_Case_2_Run_01.p
 
Done ( Thu Feb 15 22:52:33 2018 ): Lukkarinen_Case_2_Run_01.py
----------------------------------------------------------------------